In [1]:
data_dict={'name':['mike','','suzzi','chang','',''],'place':['china','ireland','japan','china',
                                                            'australia','india'],'phonenum':[1,2,3,4,5,6]}
data_dict

{'name': ['mike', '', 'suzzi', 'chang', '', ''],
 'place': ['china', 'ireland', 'japan', 'china', 'australia', 'india'],
 'phonenum': [1, 2, 3, 4, 5, 6]}

In [3]:
import pandas as pd 

df=pd.DataFrame(data_dict)
df

    name      place  phonenum
0   mike      china         1
1           ireland         2
2  suzzi      japan         3
3  chang      china         4
4         australia         5
5             india         6

In [4]:
df1=df.copy()
df1

    name      place  phonenum
0   mike      china         1
1           ireland         2
2  suzzi      japan         3
3  chang      china         4
4         australia         5
5             india         6

In [5]:
df2=df1[df1.name=='']
df2

  name      place  phonenum
1         ireland         2
4       australia         5
5           india         6

In [6]:
df2

  name      place  phonenum
1         ireland         2
4       australia         5
5           india         6

In [7]:
df3=df1[df1.name!='']
df3

    name  place  phonenum
0   mike  china         1
2  suzzi  japan         3
3  chang  china         4

如果在第一列中是 NaNs，请使用 ^{} 和指定要检查的列：

df1 = df.dropna(subset=['Name']) 删除 name 列中含有空值的整行，只保留全部没有空值的行

In [12]:
import numpy as np
data_dict={'name':['mike',np.nan,'suzzi','chang',np.nan,np.nan],'place':['china','ireland','japan','china',
                                                            'australia','india'],'phonenum':[1,2,3,4,5,6]}
data_dict

{'name': ['mike', nan, 'suzzi', 'chang', nan, nan],
 'place': ['china', 'ireland', 'japan', 'china', 'australia', 'india'],
 'phonenum': [1, 2, 3, 4, 5, 6]}

In [13]:
dff=pd.DataFrame(data_dict)
dff

    name      place  phonenum
0   mike      china         1
1    NaN    ireland         2
2  suzzi      japan         3
3  chang      china         4
4    NaN  australia         5
5    NaN      india         6

In [15]:
dff1=dff.dropna(subset=['name'])
dff1

    name  place  phonenum
0   mike  china         1
2  suzzi  japan         3
3  chang  china         4

In [16]:
# 如果行中缺少任何值，DataFrame dropna（）方法将删除整行。 df1 = df.dropna()

import numpy as np
data_dict={'name':['mike',np.nan,'suzzi','chang',np.nan,np.nan],'place':['china',np.nan,'japan','china',
                                                            'australia','india'],'phonenum':[1,np.nan,3,4,5,6]}
data_dict

{'name': ['mike', nan, 'suzzi', 'chang', nan, nan],
 'place': ['china', nan, 'japan', 'china', 'australia', 'india'],
 'phonenum': [1, nan, 3, 4, 5, 6]}

In [17]:
dk=pd.DataFrame(data_dict)
dk

    name      place  phonenum
0   mike      china       1.0
1    NaN        NaN       NaN
2  suzzi      japan       3.0
3  chang      china       4.0
4    NaN  australia       5.0
5    NaN      india       6.0

In [18]:
dfk=dk.dropna()
dfk

    name  place  phonenum
0   mike  china       1.0
2  suzzi  japan       3.0
3  chang  china       4.0

In [ ]:
# pandas 删除空数据行及列 dropna ()

import pandas as pd

# 删除含有空数据的全部行

df4 = pd.read_csv('4.csv',  encoding='utf-8')

df4 = df4.dropna()

# 可以通过 axis 参数来删除含有空数据的全部列

df4 = df4.dropna(axis=1)

# 可以通过 subset 参数来删除在 age 和 sex 中含有空数据的全部行

df4 = df4.dropna(subset=["age", "sex"])

print(df4)

df4 = df4.dropna(subset=['age', 'body','home.dest'])

In [ ]:
# 对于 DataFrame:

# data.dropna (how = 'all')    # 传入这个参数后将只丢弃全为缺失值的那些行
# data.dropna (axis = 1)       # 丢弃有缺失值的列（一般不会这么做，这样会删掉一个特征）
# data.dropna (axis=1,how="all")   # 丢弃全为缺失值的那些列
# data.dropna (axis=0,subset = ["Age", "Sex"])   # 丢弃‘Age’和‘Sex’这两列中有缺失值的行

In [19]:
# 创建 DataFrame 样例数据
import pandas as pd
import numpy as np
data = pd.DataFrame({'a': [1, 2, 4, np.nan,7, 9], 'b': ['a', 'b', np.nan, np.nan, 'd', 'e'], 'c': [np.nan, 0, 4, np.nan, np.nan, 5], 'd': [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan]})
data

     a    b    c   d
0  1.0    a  NaN NaN
1  2.0    b  0.0 NaN
2  4.0  NaN  4.0 NaN
3  NaN  NaN  NaN NaN
4  7.0    d  NaN NaN
5  9.0    e  5.0 NaN

In [25]:
data.dropna(axis=0,how='all')  # 删除 NaN 所在行

     a    b    c   d
0  1.0    a  NaN NaN
1  2.0    b  0.0 NaN
2  4.0  NaN  4.0 NaN
4  7.0    d  NaN NaN
5  9.0    e  5.0 NaN

In [26]:
data.dropna(axis=0,how='any')  # 删除表中含有任何 NaN 的行

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [27]:
data.dropna(axis=1, how='all')# 删除表中全部为 NaN 的列

     a    b    c
0  1.0    a  NaN
1  2.0    b  0.0
2  4.0  NaN  4.0
3  NaN  NaN  NaN
4  7.0    d  NaN
5  9.0    e  5.0

In [28]:
data.dropna(axis=1, how='any') # 删除表中含有任何 NaN 的列

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [ ]:
# pandas 中单元格数据处理之分割单元格信息
# 两总方法，一种是新建一个 dataframe，加上列标签，在用 concat 合并到一起。方法二比较简单，直接索引取数

In [ ]:
把一个“2000-5000”类型的数，分割为2000与5000两个，并分开显示
s_min, s_max = df_clean.loc[: , 'zwyx'].str.split('-',1).str
#split的参数1，则分割为两部分
df_min = pd.DataFrame(s_min)
df_min.columns = ['zwyx_min']
df_max = pd.DataFrame(s_max)
df_max.columns = ['zwyx_max']

df_clean_concat = pd.concat([df_clean, df_min, df_max], axis=1)
# df_clean['zwyx_min'].astype(int)
df_clean_concat['zwyx_min'] = pd.to_numeric(df_clean_concat['zwyx_min'])
df_clean_concat['zwyx_max'] = pd.to_numeric(df_clean_concat['zwyx_max'])

In [30]:
import pandas as pd
df = pd.DataFrame({'key':['a,b,c','1,2,3',['a,,,c'],np.nan]})
df['v1'] = df['key'].str.split(',').str[0]
df['v2'] = df['key'].str.split(',').str[1]
df['v3'] = df['key'].str.split(',').str[2]
df

       key   v1   v2   v3
0    a,b,c    a    b    c
1    1,2,3    1    2    3
2  [a,,,c]  NaN  NaN  NaN
3      NaN  NaN  NaN  NaN

In [ ]:
# pandas 小技巧 —— 如何删除行或者列、根据条件删除指定行或者列
# 使用 df.drop

"""
DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=‘raise’)
1、labels：要删除的标签，一个或者多个 (以 list 形式)；
2、axis：指定哪一个轴，=0 删除行，=1 删除列；
3、columns：指定某一列或者多列 (以 list 形式)；
4、level：索引等级，针对多重索引的情况；
5、inplaces：是否替换原来的 dataframe，=True 代表直接替换原始 df，=False 代表不替换原始 df

"""
# 1、直接删除指定行 / 列

# 删除列名为C的列，并替换原始df
df.drop(columns=['C'], inplace=True) 

# 2、根据条件删除指定行
# 删除符合条件的指定行，并替换原始df
df.drop(df[(df.score < 50) & (df.score > 20)].index， inplace=True)

In [1]:
# dropna () 方法过滤任何含有缺失值的行
'''
pandas.DataFrame 里，如果一行数据有任意值为空，则过滤掉整行，这时候使用 dropna() 方法是合适的。下面的案例，任意列只要有一个为空数据，则整行都干掉。但是我们常常遇到的情况，是根据一个指标（一列）数据的情况，去过滤行数据，
类似 Excel 里面的过滤漏斗，怎么办？
'''
import pandas as pd
data = pd.DataFrame([[1.,6.5,3.],[1.],[],[6.5,3.]],index=list('abcd'),columns=list('def'))
data

     d    e    f
a  1.0  6.5  3.0
b  1.0  NaN  NaN
c  NaN  NaN  NaN
d  6.5  3.0  NaN

In [2]:
data.dropna()

     d    e    f
a  1.0  6.5  3.0

In [ ]:
# 方法一：dropna () 其他参数解析
# DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

'''
参数说明：

axis:
axis=0: 删除包含缺失值的行
axis=1: 删除包含缺失值的列


how: 与 axis 配合使用
how=‘any’ : 只要有缺失值出现，就删除该行货列
how=‘all’: 所有的值都缺失，才删除行或列


thresh： axis 中至少有 thresh 个非缺失值，否则删除。比如 axis=0，thresh=10：标识如果该行中非缺失值的数量小于 10，将删除改行
subset: list，在哪些列中查看是否有缺失值
inplace: 是否在原数据上操作。如果为真，返回 None 否则返回新的 copy，去掉了缺失值
'''

In [3]:
data.dropna(axis=0,subset=['e']) #axis=0,删除行，subset的列选择

     d    e    f
a  1.0  6.5  3.0
d  6.5  3.0  NaN

In [4]:
'''
方法二：替换并删除，Python pandas 如果某列值为空，过滤删除所在行数据
如上面的 data 数据，如果希望 “e” 列数值为空 NaN 时，删除对应行也就是 “b、c” 行数据，保留其他行，用 dropna() 似乎比较麻烦。 这个时候的思路是：

fillna() 给空值填充一个数值（如 999999）
index.tolist() 找出值为填充值所在行的索引
drop 根据索引干掉对应的行
'''

data['e']=data['e'].fillna(999999)
find_index=data[(data.e==999999)].index.tolist()
find_index

['b', 'c']

In [6]:
data.drop(find_index)

     d    e    f
a  1.0  6.5  3.0
d  6.5  3.0  NaN

In [9]:
# pandas 缺失值与空值处理
'''
1. 相关函数
df.dropna()

df.fillna()

df.isnull()

df.isna()

2. 相关概念
空值：在 pandas 中的空值是 ""

缺失值：在 dataframe 中为 nan 或者 naT（缺失时间），在 series 中为 none 或者 nan 即可

3. 函数具体解释
DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
函数作用：删除含有空值的行或列

axis: 维度，axis=0 表示 index 行，axis=1 表示 columns 列，默认为 0

how:"all" 表示这一行或列中的元素全部缺失（为 nan）才删除这一行或列，"any" 表示这一行或列中只要有元素缺失，就删除这一行或列

thresh: 一行或一列中至少出现了 thresh 个才删除。

subset：在某些列的子集中选择出现了缺失值的列删除，不在子集中的含有缺失值得列或行不会删除（有 axis 决定是行还是列）

inplace：刷选过缺失值得新数据是存为副本还是直接在原数据上进行修改。

例子：
'''
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                  "born": [pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT]})
 
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [15]:
print(df)
print('-----------------------------------------')
print(df.dropna())

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
-----------------------------------------
     name        toy       born
1  Batman  Batmobile 1940-04-25

In [16]:
print('delete colums')
print(df.dropna(axis=1))

delete colums
       name
0    Alfred
1    Batman
2  Catwoman

In [17]:
print("所有值全为缺失值才删除")
print(df.dropna(how='all'))

所有值全为缺失值才删除
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [18]:
print("至少出现过两个缺失值才删除")
print(df.dropna(thresh=2))

至少出现过两个缺失值才删除
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [19]:
print("删除这个subset中的含有缺失值的行或列")
print(df.dropna(subset=['name', 'born']))

删除这个subset中的含有缺失值的行或列
     name        toy       born
1  Batman  Batmobile 1940-04-25

In [34]:
'''
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)
函数作用：填充缺失值

value: 需要用什么值去填充缺失值

axis: 确定填充维度，从行开始或是从列开始

method：ffill: 用缺失值前面的一个值代替缺失值，如果 axis =1，那么就是横向的前面的值替换后面的缺失值，如果 axis=0，那么则是上面的值替换下面的缺失值。backfill/bfill，缺失值后面的一个值代替前面的缺失值。注意这个参数不能与 value 同时出现

limit: 确定填充的个数，如果 limit=2，则只填充两个缺失值。

示例：

'''
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, np.nan, 1],
                 [np.nan, np.nan, np.nan, 5],
                [np.nan, 3, np.nan, 4]],
                 columns=list('ABCD'))
 
print(df)
 
print("横向用缺失值前面的值替换缺失值")
print(df.fillna(axis=1,method='ffill'))
 
print("纵向用缺失值上面的值替换缺失值")
print(df.fillna(axis=0,method='ffill'))

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4
横向用缺失值前面的值替换缺失值
     A    B    C    D
0  NaN  2.0  2.0  0.0
1  3.0  4.0  4.0  1.0
2  NaN  NaN  NaN  5.0
3  NaN  3.0  3.0  4.0
纵向用缺失值上面的值替换缺失值
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  3.0  4.0 NaN  5
3  3.0  3.0 NaN  4

In [35]:
print(df.fillna(0))

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4

In [36]:
# 不同的列用不同的值填充：

values={'A':0,'B':1,'C':2,'D':3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [37]:
# 对每列出现的替换值有次数限制，此处限制为一次
df.fillna(value=values,limit=1)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  NaN  1
2  NaN  1.0  NaN  5
3  NaN  3.0  NaN  4

In [50]:
# DataFrame.isna()
# 判断是不是缺失值：
import pandas as pd 
import numpy as np 
import datetime

df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                  [3, 4, "", 1],
                 [np.nan, np.nan, np.nan, 5],
                [np.nan, 3, "", 4]],
                 columns=list('ABCD'))
 
df

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0       1
2  NaN  NaN  NaN  5
3  NaN  3.0       4

In [51]:
'''
如上，缺失值是 NAN，空值是没有显示。

替换空值代码：需要把含有空值的那一列提出来单独处理，然后在放进去就好。
'''

clean_z=df['C'].fillna(0)
clean_z[clean_z=='']='hello'
df['C']=clean_z
df

     A    B      C  D
0  NaN  2.0      0  0
1  3.0  4.0  hello  1
2  NaN  NaN      0  5
3  NaN  3.0  hello  4

In [52]:
df.isna()

       A      B      C      D
0   True  False  False  False
1  False  False  False  False
2   True   True  False  False
3   True  False  False  False

## Pandas 对列进行重命名

In [53]:
# Pandas 对列进行重命名
# 在处理 DataFrame 数据的时候，经常需要对列进行重命名，我们现在看一下到底如何进行重命名操作。
# 首先生成一个 DataFrame。

import pandas as pd

province=pd.DataFrame({'省份':['广东','广西','福建','福建省'],
                      'ID':[1,2,3,4],
                      'code':['a','b','c','d']})
province

    省份  ID code
0   广东   1    a
1   广西   2    b
2   福建   3    c
3  福建省   4    d

In [54]:
# 然后把ID变成id，code变成编码。

# 方法 1
# rename 的方式。



province.rename(columns={'ID':'id','code':'编码'})

    省份  id 编码
0   广东   1  a
1   广西   2  b
2   福建   3  c
3  福建省   4  d

In [55]:
# 方法 2
# 直接改 DataFrame 的 columns


p_col=['省份','id','编码']
province.columns=p_col
province

    省份  id 编码
0   广东   1  a
1   广西   2  b
2   福建   3  c
3  福建省   4  d

In [56]:
# 方法 3
# 重新生成一个新的列表，也可以用于在读取 Excel 或者 csv 的时候，进行列名更改


p_col=['省份','id','编码']
province_new=pd.DataFrame(province,columns=p_col)
province_new

    省份  id 编码
0   广东   1  a
1   广西   2  b
2   福建   3  c
3  福建省   4  d

In [ ]:
import pandas as pd
comany = pd.read_csv('../data/public/year_report_train_sum.csv')
comany.rename(columns={'净纳税总额利润':'净利润'},inplace = True)